spa/cypress/fixtures/donations/results-single-rp.json

[
  {
    "amount": 12301,
    "auto_accepted_on": null,
    "bad_actor_score": null,
    "contributor_email": "fake@foo.com",
    "created": "2022-08-13T05:17:29.588325Z",
    "first_payment_date": "2022-08-13T05:17:29.588325Z",
    "currency": "usd",
    "donation_page_id": 1,
    "flagged_date": null,
    "formatted_payment_provider_used": "Stripe",
    "id": 40,
    "interval": "one_time",
    "last_payment_date": "2022-08-13T05:17:29Z",
    "provider_customer_url": "https://dashboard.stripe.com/customers/cus_fake_id",
    "provider_payment_url": "https://dashboard.stripe.com/payments/pi_fake_pi_id",
    "provider_subscription_url": "",
    "revenue_program": {
      "id": 3,
      "name": "Fake RP Name",
      "slug": "fake-rp-name"
    },
    "status": "paid"
  },
  {
    "amount": 100,
    "auto_accepted_on": null,
    "bad_actor_score": null,
    "contributor_email": "jon.doe+again@fundjournalism.org",
    "created": "2022-08-04T19:48:51.847596Z",
    "first_payment_date": "2022-08-04T19:48:51.847596Z",
    "currency": "usd",
    "donation_page_id": 1,
    "flagged_date": null,
    "formatted_payment_provider_used": "Stripe",
    "id": 39,
    "interval": "month",
    "last_payment_date": "2022-08-04T19:48:52Z",
    "provider_customer_url": "https://dashboard.stripe.com/customers/cus_fake_id",
    "provider_payment_url": "https://dashboard.stripe.com/payments/pi_fake_pi_id",
    "provider_subscription_url": "https://dashboard.stripe.com/subscriptions/sub_fake_sub_id",
    "revenue_program": {
      "id": 3,
      "name": "Fake RP Name",
      "slug": "fake-rp-name"
    },
    "status": "paid"
  },
  {
    "amount": 100,
    "auto_accepted_on": null,
    "bad_actor_score": null,
    "contributor_email": "jon.doe@fundjournalism.org",
    "created": "2022-08-04T19:47:17.281642Z",
    "first_payment_date": "2022-08-04T19:47:17.281642Z",
    "currency": "usd",
    "donation_page_id": 1,
    "flagged_date": null,
    "formatted_payment_provider_used": "Stripe",
    "id": 38,
    "interval": "month",
    "last_payment_date": "2022-08-04T19:47:18Z",
    "provider_customer_url": "https://dashboard.stripe.com/customers/cus_fake_id",
    "provider_payment_url": "https://dashboard.stripe.com/payments/pi_fake_pi_id",
    "provider_subscription_url": "https://dashboard.stripe.com/subscriptions/sub_fake_sub_id",
    "revenue_program": {
      "id": 3,
      "name": "Fake RP Name",
      "slug": "fake-rp-name"
    },
    "status": "paid"
  },
  {
    "amount": 100,
    "auto_accepted_on": null,
    "bad_actor_score": null,
    "contributor_email": "jon.doe@fundjournalism.org",
    "created": "2022-08-04T19:28:15.763185Z",
    "first_payment_date": "2022-08-04T19:28:15.763185Z",
    "currency": "usd",
    "donation_page_id": 1,
    "flagged_date": null,
    "formatted_payment_provider_used": "Stripe",
    "id": 37,
    "interval": "one_time",
    "last_payment_date": "2022-08-04T19:28:15Z",
    "provider_customer_url": "https://dashboard.stripe.com/customers/cus_fake_id",
    "provider_payment_url": "https://dashboard.stripe.com/payments/pi_fake_pi_id",
    "provider_subscription_url": "",
    "revenue_program": {
      "id": 3,
      "name": "Fake RP Name",
      "slug": "fake-rp-name"
    },
    "status": "paid"
  },
  {
    "amount": 100,
    "auto_accepted_on": null,
    "bad_actor_score": null,
    "contributor_email": "jon.doe@fundjournalism.org",
    "created": "2022-08-04T19:24:56.853635Z",
    "first_payment_date": "2022-08-04T19:24:56.853635Z",
    "currency": "usd",
    "donation_page_id": 1,
    "flagged_date": null,
    "formatted_payment_provider_used": "Stripe",
    "id": 36,
    "interval": "one_time",
    "last_payment_date": "2022-08-04T19:24:56Z",
    "provider_customer_url": "https://dashboard.stripe.com/customers/cus_fake_id",
    "provider_payment_url": "https://dashboard.stripe.com/payments/pi_fake_pi_id",
    "provider_subscription_url": "",
    "revenue_program": {
      "id": 3,
      "name": "Fake RP Name",
      "slug": "fake-rp-name"
    },
    "status": "paid"
  },
  {
    "amount": 36500,
    "auto_accepted_on": null,
    "bad_actor_score": null,
    "contributor_email": "fake-name@fundjournalism.org",
    "created": "2022-08-04T16:48:47.413337Z",
    "first_payment_date": "2022-08-04T16:48:47.413337Z",
    "currency": "usd",
    "donation_page_id": 1,
    "flagged_date": null,
    "formatted_payment_provider_used": "Stripe",
    "id": 35,
    "interval": "month",
    "last_payment_date": "2022-08-04T16:48:48Z",
    "provider_customer_url": "https://dashboard.stripe.com/customers/cus_fake_id",
    "provider_payment_url": "https://dashboard.stripe.com/payments/pi_fake_pi_id",
    "provider_subscription_url": "https://dashboard.stripe.com/subscriptions/sub_fake_sub_id",
    "revenue_program": {
      "id": 3,
      "name": "Fake RP Name",
      "slug": "fake-rp-name"
    },
    "status": "paid"
  },
  {
    "amount": 12000,
    "auto_accepted_on": null,
    "bad_actor_score": null,
    "contributor_email": "fake-name@fundjournalism.org",
    "created": "2022-08-04T16:48:02.607476Z",
    "first_payment_date": "2022-08-04T16:48:02.607476Z",
    "currency": "usd",
    "donation_page_id": 1,
    "flagged_date": null,
    "formatted_payment_provider_used": "Stripe",
    "id": 34,
    "interval": "one_time",
    "last_payment_date": "2022-08-04T16:48:01Z",
    "provider_customer_url": "https://dashboard.stripe.com/customers/cus_fake_id",
    "provider_payment_url": "https://dashboard.stripe.com/payments/pi_fake_pi_id",
    "provider_subscription_url": "",
    "revenue_program": {
      "id": 3,
      "name": "Fake RP Name",
      "slug": "fake-rp-name"
    },
    "status": "paid"
  },
  {
    "amount": 100,
    "auto_accepted_on": null,
    "bad_actor_score": null,
    "contributor_email": "jon.doe@fundjournalism.org",
    "created": "2022-08-04T16:47:47.108739Z",
    "first_payment_date": "2022-08-04T16:47:47.108739Z",
    "currency": "usd",
    "donation_page_id": 1,
    "flagged_date": null,
    "formatted_payment_provider_used": "Stripe",
    "id": 33,
    "interval": "one_time",
    "last_payment_date": "2022-08-04T16:47:46Z",
    "provider_customer_url": "https://dashboard.stripe.com/customers/cus_fake_id",
    "provider_payment_url": "https://dashboard.stripe.com/payments/pi_fake_pi_id",
    "provider_subscription_url": "",
    "revenue_program": {
      "id": 3,
      "name": "Fake RP Name",
      "slug": "fake-rp-name"
    },
    "status": "paid"
  },
  {
    "amount": 100,
    "auto_accepted_on": null,
    "bad_actor_score": null,
    "contributor_email": "jon.doe@fundjournalism.org",
    "created": "2022-08-04T16:46:41.772940Z",
    "first_payment_date": "2022-08-04T16:46:41.772940Z",
    "currency": "usd",
    "donation_page_id": 1,
    "flagged_date": null,
    "formatted_payment_provider_used": "Stripe",
    "id": 32,
    "interval": "one_time",
    "last_payment_date": "2022-08-04T16:46:41Z",
    "provider_customer_url": "https://dashboard.stripe.com/customers/cus_fake_id",
    "provider_payment_url": "https://dashboard.stripe.com/payments/pi_fake_pi_id",
    "provider_subscription_url": "",
    "revenue_program": {
      "id": 3,
      "name": "Fake RP Name",
      "slug": "fake-rp-name"
    },
    "status": "paid"
  },
  {
    "amount": 100,
    "auto_accepted_on": null,
    "bad_actor_score": null,
    "contributor_email": "jon.doe+barrrr@fundjournalism.org",
    "created": "2022-08-04T16:45:01.529898Z",
    "first_payment_date": "2022-08-04T16:45:01.529898Z",
    "currency": "usd",
    "donation_page_id": 1,
    "flagged_date": null,
    "formatted_payment_provider_used": "Stripe",
    "id": 31,
    "interval": "one_time",
    "last_payment_date": "2022-08-04T16:45:01Z",
    "provider_customer_url": "https://dashboard.stripe.com/customers/cus_fake_id",
    "provider_payment_url": "https://dashboard.stripe.com/payments/pi_fake_pi_id",
    "provider_subscription_url": "",
    "revenue_program": {
      "id": 3,
      "name": "Fake RP Name",
      "slug": "fake-rp-name"
    },
    "status": "paid"
  }
]
